{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Snake","config":{"alpha":1.61803398875,"units":288,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder1_a1.62","trainable":true,"batch_input_shape":[null,288],"dtype":"float32"}},{"class_name":"Snake","config":{"alpha":1,"units":100,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"code_snake","trainable":true}},{"class_name":"Snake","config":{"alpha":1.61803398875,"units":192,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder1_a1.62","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"encoder1_a1.62/kernel","shape":[288,288],"dtype":"float32"},{"name":"encoder1_a1.62/bias","shape":[288],"dtype":"float32"},{"name":"code_snake/kernel","shape":[288,100],"dtype":"float32"},{"name":"code_snake/bias","shape":[100],"dtype":"float32"},{"name":"decoder1_a1.62/kernel","shape":[100,192],"dtype":"float32"},{"name":"decoder1_a1.62/bias","shape":[192],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}