{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Snake","config":{"alpha":1.61803398875,"units":192,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder1_a1.62","trainable":true,"batch_input_shape":[null,192],"dtype":"float32"}},{"class_name":"Snake","config":{"alpha":2.618033988750235,"units":154,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder2_a2.62","trainable":true}},{"class_name":"Snake","config":{"alpha":4.236067977500615,"units":123,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder3_a4.24","trainable":true}},{"class_name":"Snake","config":{"alpha":1,"units":6,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"code_snake","trainable":true}},{"class_name":"Snake","config":{"alpha":4.236067977500615,"units":123,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder1_a4.24","trainable":true}},{"class_name":"Snake","config":{"alpha":2.618033988750235,"units":154,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder2_a2.62","trainable":true}},{"class_name":"Snake","config":{"alpha":1.61803398875,"units":192,"activation":"snake_activation","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder3_a1.62","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"encoder1_a1.62/kernel","shape":[192,192],"dtype":"float32"},{"name":"encoder1_a1.62/bias","shape":[192],"dtype":"float32"},{"name":"encoder2_a2.62/kernel","shape":[192,154],"dtype":"float32"},{"name":"encoder2_a2.62/bias","shape":[154],"dtype":"float32"},{"name":"encoder3_a4.24/kernel","shape":[154,123],"dtype":"float32"},{"name":"encoder3_a4.24/bias","shape":[123],"dtype":"float32"},{"name":"code_snake/kernel","shape":[123,6],"dtype":"float32"},{"name":"code_snake/bias","shape":[6],"dtype":"float32"},{"name":"decoder1_a4.24/kernel","shape":[6,123],"dtype":"float32"},{"name":"decoder1_a4.24/bias","shape":[123],"dtype":"float32"},{"name":"decoder2_a2.62/kernel","shape":[123,154],"dtype":"float32"},{"name":"decoder2_a2.62/bias","shape":[154],"dtype":"float32"},{"name":"decoder3_a1.62/kernel","shape":[154,192],"dtype":"float32"},{"name":"decoder3_a1.62/bias","shape":[192],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}